Ewalk02/fishduino/sdkconfig.defaults
#
# Fishduino defaults (ESP32-P4-WIFI6 + 4-DSI-TOUCH-A)
#

CONFIG_IDF_TARGET="esp32p4"

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set

# Prefer PSRAM on ESP32-P4 builds that use DSI framebuffers.
CONFIG_SPIRAM=y

# Keep log noise reasonable during bring-up.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Waveshare 4-DSI-TOUCH-A (480x800)
CONFIG_BSP_LCD_TYPE_480_800_4_INCH_A=y
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y

# ESP-Hosted Wi-Fi (ESP32-C6 coprocessor over SDIO)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64

# SNTP
CONFIG_LWIP_SNTP_MAX_SERVERS=1

